PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_platform.h
/***************************************************************************//**
* \file ifx_se_platform.h
* \version 1.1.0
*
* \brief
* This is the header file for utility syscall functions.
*
********************************************************************************
* \copyright
* Copyright 2022-2024, Cypress Semiconductor Corporation (an Infineon company).
* All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/*******************************************************************************
* IFX SE Generic Syscall API definitions
****************************************************************************//**
*
* \defgroup platform     IFX SE Generic Syscall API
* \brief
*  IFX SE Generic Syscall functions
*
* \{
*   \defgroup platform_power Enable/Disable/Power control
*       Enable/Disable/Power control definitions
*   \defgroup platform_rollbacks Anti-rollback counter manipulation
*       Anti-rollback counter manipulation definitions
*   \defgroup platform_attestation Initial Attestation Token
*       Initial Attestation Token definitions
*   \defgroup platform_mpc MPC protection management
*       MPC protection management definitions
*   \defgroup platform_ppc PPC protection management
*       PPC protection management definitions
*   \defgroup platform_wifi WiFi SS control
*       WiFi SS control definitions
* \}
*
*******************************************************************************/

#ifndef IFX_SE_PLATFORM_H
#define IFX_SE_PLATFORM_H

#include "ifx_se_syscall.h"
#include "ifx_se_psacrypto_types.h"
#include "cy_utils.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if defined(CY_IP_MXS22WIFI1X1AX20TBSS) && defined(CY_IP_MXS22BTSS)
/* Syscall handler is placed at fixed address in S RT Services code */
#define IFX_SE_SYSCALL_HANDLER_ADDR         0x120143a5u
#endif /* defined(CY_IP_MXS22WIFI1X1AX20TBSS) && defined(CY_IP_MXS22BTSS) */

/* Public APIs */

/* SE RT Services OTP anti-rollback counters are numbered 0..7 */
#define IFX_SE_OTP_ROLLBACK_COUNTER_NUM_MIN     0u
#define IFX_SE_OTP_ROLLBACK_COUNTER_NUM_MAX     7u

/* SE RT Services RRAM anti-rollback counters are numbered 8..15 */
#define IFX_SE_RRAM_ROLLBACK_COUNTER_NUM_MIN    8u
#define IFX_SE_RRAM_ROLLBACK_COUNTER_NUM_MAX    15u

/* Minimum allowed value of a key tag */
#define IFX_SE_MIN_USER_ALLOWED_KEY_TAG         (IFX_SE_KEY_ID_VENDOR_MAX + 1u)

/** \addtogroup platform_rollbacks
 * \{
 */

/*******************************************************************************
 * Function Name: ifx_se_get_rollback_counter
 ***************************************************************************//**
 *
 * This function reads the Anti-rollback counter.
 *
 * \param[in] number     Anti-rollback counter number (0-15).
 * \param[out] value     The pointer to the counter value of ifx_se_fih_uint
 *                       type.
 * \param[in] ctx        The pointer to the SE syscall context that contain
 *                       a special syscall data (IPC release callback etc).
 *
 * \note For OTP counters if the function is called in concurrent environment
 *       and RRAM controller is locked by another PC, the function immediately
 *       returns an error.
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_get_rollback_counter(ifx_se_fih_t number, ifx_se_fih_ptr_t value, void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_update_rollback_counter
 ***************************************************************************//**
 *
 * Updates the anti-rollback counter to a higher value only.
 *
 * Counters 0...7 are stored in OTP.
 * Counters 8...15 are stored in SFLASH.
 *
 * \param[in] number     Anti-rollback counter number (0-15).
 * \param[in] value      A new 32-bit counter value.
 * \param[in] ctx        The pointer to the SE syscall context that contain
 *                       a special syscall data (IPC release callback etc).
 *
 * \note For OTP counters if the function is called in concurrent environment
 *       and RRAM controller is locked by another PC, the function immediately
 *       returns an error.
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_update_rollback_counter(ifx_se_fih_t number, ifx_se_fih_t value, void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_get_usage_limit_counter
 ***************************************************************************//**
 *
 * This function reads the usage limit counter value for the given key.
 *
 * \param[in] key        Identifier of the key which usage limit counter to read.
 * \param[out] value     The pointer to the 32-bit counter value.
 * \param[in] ctx        The pointer to the SE syscall context that contain
 *                       a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_get_usage_limit_counter(ifx_se_key_id_fih_t key, ifx_se_fih_ptr_t value, void *ctx);

/** \} */

/** \addtogroup platform_power
 * \{
 */

/*******************************************************************************
 * Function Name: ifx_se_disable
 ***************************************************************************//**
 *
 * Disables Clock Supervisor Fault and SE RT Services except Disable and Enable
 * syscalls.
 *
 * \param[in] ctx    The pointer to the SE syscall context that contain
 *                   a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 * \note This function can be used by TF-M to hold SE RT Services
 *       for the clocks and/or power setting update in the SOC.
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_disable(void *ctx);

