PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_platform.h
/*******************************************************************************
 * Function Name: ifx_se_enable
 ***************************************************************************//**
 *
 * Validates clock and power configuration,
 * configures and enables Clock Supervisor then enables SE RT Services.
 *
 *
 * \param[in] ctx   The pointer to the SE syscall context that contain
 *                  a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success
 * \return    \ref IFX_SE_SYSCALL_RRAM_CLK_ERROR when RRAM clock (HFCLK0)
 *            not corresponding to selected RRAM power mode (LP/ULP)
 * \return    \ref IFX_SE_SYSCALL_INVALID_CLOCK when CPU clock (HFCLK0)
 *            frequency not in the supported range (3,6MHz - 210MHz)
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_enable(void *ctx);

/** SE power mode */
typedef enum
{
    IFX_SE_PM_DEEP_SLEEP = 0,           /**< DeepSleep mode */
    IFX_SE_PM_DEEP_SLEEP_RAM = 1,       /**< DeepSleep RAM mode (obsoleted) */
    IFX_SE_PM_SHUT_OFF = 2,             /**< Shut off mode */
    IFX_SE_PM_MAX                       /**< Maximum value to fix enum size */
} ifx_se_en_power_mode_t;

/*******************************************************************************
 * Function Name: ifx_se_set_lpm
 ***************************************************************************//**
 *
 * Sets power mode which SE RT Services will use during wait for event state.
 *
 * \param[in] mode   Power mode value.
 * \param[in] ctx    The pointer to the SE syscall context that contain
 *                   a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 * \note  This function is only for internal use and couldn't be called directly.
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_set_lpm(ifx_se_en_power_mode_t mode, void *ctx);


/** The structure of data which provides provisioned data shared by RRAM Boot during initialization */
typedef struct
{
#if defined(CY_IP_MXS22WIFI1X1AX20TBSS) && defined(CY_IP_MXS22BTSS)
    uint32_t wifi_ap_ctl;       /**<  WIFI access port control */
    uint32_t wifi_wounding[2];  /**<  1st word is HW wounding, 2nd is SW wounding */
    uint32_t bt_ap_ctl;         /**<  BT access port control */
    uint32_t bt_wounding[2];    /**<  1st word is HW wounding, 2nd is SW wounding */
#else
    int32_t temperature;        /**<  Temperature measured during boot */
#endif /* defined(CY_IP_MXS22WIFI1X1AX20TBSS) && defined(CY_IP_MXS22BTSS) */
} ifx_se_rt_info_t;

/*******************************************************************************
 * Function Name: ifx_se_get_info
 ***************************************************************************//**
 *
 * This function reads the system information passed from RRAM Boot and copies it
 * to output buffer.
 *
 * \param[out] output      Buffer where the output is to be written.
 * \param[in] output_size  Size of the \p output buffer in bytes.
 * \param[in] ctx          The pointer to the SE syscall context that contain
 *                         a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 ******************************************************************************/
ifx_se_status_t ifx_se_get_info(ifx_se_rt_info_t *output, size_t output_size, void *ctx);


/** \} */

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 3.1', 2, \
                             'The character sequence "//" is a part of http URL.')

/** \addtogroup platform_attestation
 * \{
 *
 * SE RT Services supports Initial Attestation Token generation according to
 * "Arm's Platform Security Architecture (PSA) Attestation Token" RFC document
 * https://datatracker.ietf.org/doc/draft-tschofenig-rats-psa-token/
 *
 * SE RT Services provide Initial Attestation token generation in next steps:
 * - set shared data (measurements) of images by L1 and L2 bootloaders using
 *   \ref ifx_se_set_shared_data API.
 * - get Initial Attestation token size to allocate memory buffer for token
 * - get Initial Attestation token into provided buffer
 *
 * Shared data can be locked to prevent any changes of measurements
 * using \ref ifx_se_lock_shared_data API.
 *
 * Storage for shared data supports up to 7 data blocks of 0x80 bytes,
 * for IDs from 0 to 6.
 *
 * Attestation token \ref ifx_se_initial_attest_get_token_size API returns
 * MAXIMAL size of possible generated token in CBOR format calculated from:
 * - maximal size of challenge, 64 bytes
 * - size of Client ID, 4 bytes (integer value)
 * - maximal size of Verification Services, 32 bytes
 * - maximal size of Certification Reference (Hardware version),
 *   19 bytes (EAN-13-5 string)
 * - maximal size of Profile definition, 32 bytes
 * - maximal size of Implementation ID, 32 bytes
 * - maximal size of Instance ID, 33 bytes
 * - maximal size of Security lifecycle,  4 bytes (integer value)
 * - maximal size of Boot seed, 32 bytes
 * - software components data claim
 * - set of uploaded shared data blocks, max 0x80 per block
 * - system assets information for ROMBoot, RRAMBoot, L1_Boot, SE RT Services;
 *   data block of 384 bytes
 *
 * Maximal supported token size is 1510 bytes.
 *
 * \note SE RT Services supports only PSA 2.0.0 profile.
 *
 * Software components claim ALWAYS contain information of system assets:
 *
 * | Asset          | Name             | Version              | Descr  | Signer_ID                                                     | Value            |
 * |:---------------|:-----------------|:---------------------|:-------|:--------------------------------------------------------------|:-----------------|
 * | ROMBoot        | "ROM boot"       | actual asset version |        | -                                                             | -                |
 * | RRAMBoot       | "RRAM boot"      | actual asset version | SHA256 | -                                                             | asset image hash |
 * | L1_Boot        | "L1 boot"        | actual asset version | SHA256 | -                                                             | asset image hash |
 * | SE RT Services | "SE RT Services" | actual asset version | SHA256 | hash of the signing key <br>\ref IFX_SE_KEY_ID_BUILTIN_ATTEST | asset image hash |
 */

