PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_platform.h
/*******************************************************************************
 * Function Name: ifx_se_initial_attest_get_token_size
 ***************************************************************************//**
 *
 * Gets Initial Attestation Token maximal size to allocate token buffer.
 *
 * Use this value to allocate space for ifx_se_initial_attest_get_token.
 *
 * \param[in] challenge_size  The length of the challenge object (size_t).
 * \param[out] token_size     The pointer to the actual length of the
 *                            attestation token (size_t).
 * \param[in] ctx             The pointer to the SE syscall context that contain
 *                            a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_initial_attest_get_token_size(ifx_se_fih_t challenge_size,
        ifx_se_fih_ptr_t token_size,
        void *ctx);
/** \} */

/** \addtogroup platform_mpc
 * \{
 */

/** MPC access permission */
typedef enum
{
    IFX_SE_MPC_ACCESS_DISABLED = 0x00,  /**< Read and Write disabled */
    IFX_SE_MPC_ACCESS_R = 0x01,         /**< Read enabled */
    IFX_SE_MPC_ACCESS_W = 0x02,         /**< Write enabled */
    IFX_SE_MPC_ACCESS_RW = 0x03,        /**< Read and Write enabled */
    IFX_SE_MPC_ACCESS_MAX = INT32_MAX,  /**< Maximum value to fix enum size */
} ifx_se_mpc_access_attr_t;

/** MPC security permission */
typedef enum
{
    IFX_SE_MPC_SECURE = 0x0,                /**< Secure */
    IFX_SE_MPC_NON_SECURE = 0x1,            /**< Non-secure */
    IFX_SE_MPC_SEC_ATTR_MAX = INT32_MAX,    /**< Maximum value to fix enum size */
} ifx_se_mpc_sec_attr_t;

/** MPC block size */
typedef enum
{
    IFX_SE_MPC_SIZE_4KB = 7,            /**< 4 Kilobytes */
    IFX_SE_MPC_SIZE_MAX = INT32_MAX,    /**< Maximum value to fix enum size */
} ifx_se_mpc_size_t;

/** MPC protection context */
typedef enum
{
    IFX_SE_MPC_PC_2 = 2,                /**< PC 2 */
    IFX_SE_MPC_PC_3 = 3,                /**< PC 3 */
    IFX_SE_MPC_PC_4 = 4,                /**< PC 4 */
    IFX_SE_MPC_PC_5 = 5,                /**< PC 5 */
    IFX_SE_MPC_PC_6 = 6,                /**< PC 6 */
    IFX_SE_MPC_PC_7 = 7,                /**< PC 7 */
    IFX_SE_MPC_PC_MAX = INT32_MAX,      /**< Maximum value to fix enum size */
} ifx_se_mpc_prot_context_t;

/** MPC configuration structure */
typedef struct
{
    uint32_t addr_offset;               /**< Offset in the memory from the memory start address */
    uint32_t size;                      /**< Size of the memory */
    ifx_se_mpc_size_t region_size;      /**< Size of the memory region */
    ifx_se_mpc_prot_context_t pc;       /**< Protection Context */
    ifx_se_mpc_sec_attr_t secure;       /**< Security permissions for the region */
    ifx_se_mpc_access_attr_t access;    /**< Access permissions for the region */
} ifx_se_mpc_rot_cfg_t;

/** MPC configuration structure with checksum */
typedef struct
{
    ifx_se_mpc_rot_cfg_t mpc_config;    /**< MPC configuration data */
    uint32_t crc;                       /**< checksum */
} ifx_se_mpc_rot_cfg_crc_t;

/*******************************************************************************
 * Function Name: ifx_se_mpc_config_rot_mpc_struct
 ***************************************************************************//**
 *
 * Initializes the MPC by setting the PC, NS/S and RW/R/W permissions
 * for RRAM memory region.
 *
 * This function allows to configure only one MPC structure: RRAM Host port
 * with permissions for PC>1. Can be called by PC=2 only and does not allow
 * to modify MPC configuration for the regions PC=2 does not have access to.
 *
 * \param[in] mpc_config    The pointer to the MPC configuration structure.
 * \param[in] ctx           The pointer to the SE syscall context that contain
 *                          a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_mpc_config_rot_mpc_struct(const ifx_se_mpc_rot_cfg_crc_t *mpc_config, void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_mpc_lock
 ***************************************************************************//**
 *
 * Locks the MPC configuration.
 * This function allows to lock only one MPC structure: RRAM Host port
 *
 * \param[in] ctx    The pointer to the SE syscall context that contain
 *                   a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_mpc_lock(void *ctx);

/** \} */

/** \addtogroup platform_ppc
 * \{
 */

/** PPC security attributes */
typedef enum
{
    IFX_SE_PPC_SECURE     = 0,          /**< PPC region is Secure */
    IFX_SE_PPC_NON_SECURE = 1,          /**< PPC region is Non-secure */
    IFX_SE_PPC_MAX        = INT32_MAX,  /**< Maximum value to fix enum size */
} ifx_se_ppc_sec_attribute_t;

/** PPC Non-secure privilege attributes */
typedef enum
{
    IFX_SE_PPC_NON_SEC_PRIV    = 0,          /**< Privilege access to non-secure region */
    IFX_SE_PPC_NON_SEC_NONPRIV = 1,          /**< Privilege and non-privilege access to non-secure region  */
    IFX_SE_PPC_NON_SEC_MAX     = INT32_MAX,  /**< Maximum value to fix enum size */
} ifx_se_ppc_nspriv_attribute_t;

/** PPC Secure privilege attributes */
typedef enum
{
    IFX_SE_PPC_SEC_PRIV    = 0,          /**< Privilege access to secure region */
    IFX_SE_PPC_SEC_NONPRIV = 1,          /**< Privilege and non-privilege access to secure region  */
    IFX_SE_PPC_SEC_MAX     = INT32_MAX,  /**< Maximum value to fix enum size */
} ifx_se_ppc_secpriv_attribute_t;

/** PPC configuration structure */
typedef struct
{
    uint32_t start_region;                             /**< Starting peripheral region ID */
    uint32_t end_region;                               /**< Ending peripheral region ID. To apply policy to a single peripheral region, assign the same value to start_region and endRegion */
    ifx_se_ppc_sec_attribute_t sec_attribute;          /**< Security attribute */
    ifx_se_ppc_secpriv_attribute_t sec_priv_attribute; /**< Secure Privilege attribute */
    ifx_se_ppc_nspriv_attribute_t ns_priv_attribute;   /**< Non-secure Privilege attribute */
    uint32_t pc_mask;                                  /**< PC mask */
} ifx_se_ppc_config_t;


