PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_platform.h
/*******************************************************************************
 * Function Name: ifx_se_ppc_config
 ***************************************************************************//**
 *
 * Configures the PPC with the PC mask, security and access attributes
 *
 * This function allows to configure only WiFi SS SRAM PPC regions.
 * Returns error if this function is called outside of WiFi SS PC.
 *
 * \param[in] ppc_config    The pointer to the PPC configuration structure.
 * \param[in] ctx           The pointer to the SE syscall context that contain
 *                          a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_ppc_config(const ifx_se_ppc_config_t *ppc_config, void *ctx);

/** \} */

/** \addtogroup platform_wifi
 * \{
 */

/*******************************************************************************
 * Function Name: ifx_se_enable_wifi
 ***************************************************************************//**
 *
 * Performs HASH validation for RRAM WiFiSS FW Image and if success starts this
 * image on WiFiSS. The image address is provided as an input parameter.
 *
 * It also makes sure that CPUSS APP(s) cannot access the WiFiSS and its SRAM
 * contents when Wi-Fi is functional.
 *
 * \param[in] *image_addr   The image address. The length of the image is
 *                          located in the first 4 bytes in the image.
 * \param[in] ctx           The pointer to the SE syscall context that contain
 *                          a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_enable_wifi(const uint8_t *image_addr, void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_disable_wifi
 ***************************************************************************//**
 *
 * Disables WiFiSS and switch its power off.
 *
 * \param[in] ctx           The pointer to the SE syscall context that contain
 *                          a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_disable_wifi(void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_enable_wifi_sram_access
 ***************************************************************************//**
 *
 * Enables only Wi-Fi SS SRAM for staging of RAM_APPs and allows CPUSS access
 *  to this memory.
 *
 * \param[in] ctx           The pointer to the SE syscall context that contain
 *                          a special syscall data (IPC release callback etc).
 *
 * \return    \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_enable_wifi_sram_access(void *ctx);

/** \} */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* IFX_SE_PLATFORM_H */
